package 추상클래스;

public class 이론정리 {
		
//	추상클래스 (abstract class)
/*	
 *  abstract가 클래스 앞에 붙으면 추상클래스 메서드 앞에 붙으면 추상메서드
 *  
 *  추상클래스는 완성되지 않은 설계도같은 개념이기 때문에 인스턴스를 생성할 수 없다. (new ~~~();)
 *  추상메서드를 1개 이상 포함하고 있는 클래스이다.
 *  추상메서드란 구현부가 없이 선언부만 있는 메서드를 말한다
 *  ex) abstract void sendMsg(Striing content);
 *  필요 시 자손마다 다르게 구현될 것이라고 예상될 때 사용한다.
 *  
 *  다른 클래스를 작성하는 데 도움을 줄 목적으로 이용된다.
 *  
 *  단, 추상 클래스가 인스턴스를 생성하기 위해서는 상속을 통해 자손클래스에서 추상 메서드의 구현부까지 다 구현해야 비로소 인스턴스를 생성할 수 있다.
 *  but 일부만 구현하는 경우도 있다.
 *  
 *  추상클래스를 상속받은 자손클래스가 일부만 구현한다면 클래스 앞에 abstract를 붙인다
 */
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
